# Часть от целого
name = 'Сейчас на Земле появился новый вид роботов. Раньше их называли „железной оравой “, но это не очень точное определение'
print(len('Сейчас на Земле появился новый вид роботов.'))
print(name[:43])
name = 'Сейчас на Земле появился новый вид роботов.'
print(name[0:6])
name = 'Сейчас на Земле появился новый вид роботов'
print(name[7:9])
name = 'Сейчас на Земле появился новый вид роботов'
print(name[35:])
name = 'Сейчас на Земле появился новый вид роботов'
print(name[0:4:3])

# Палиндром
name = 'радар'
print(name[::-1])
name = 'норма'
print(name[::-1])

a = 'кенг'
b = 'уру'
print(b + a)

name = "нейропрограммирование"
print(name[::2])
print(name[1::2])


name = "нейропластичность"
print(name[-2:0:-1])
name = 'нейропластичность'
print(name[-3:0:-1])
